<template>
  <div class="wrapper">
    <div class="pointers">
      <img
        class="left-pointer pointer"
        @click="showPrev"
        src="~/assets/icons/left-pointer.svg"
      />
      <img
        class="right-pointer pointer"
        @click="showNext"
        src="~/assets/icons/right-pointer.svg"
      />
    </div>
    <VueSlickCarousel
      ref="carousel"
      :arrows="false"
      :dots="false"
      :infinite="true"
      :rows="2"
      :sliderPerRow="1"
      :draggable="true"
      :autoplay="true"
    >
      <div class="slider" v-for="c in comments" :key="c.id">
        <Comment :comment="c" />
      </div>
    </VueSlickCarousel>
  </div>
</template>
<style lang="scss" scoped>
@import "~/assets/styles/breakpoints.scss";
@import "~/assets/styles/colors.scss";
.wrapper {
  display: flex;
  flex-direction: column;
  width: 80rem;
  margin: 0 auto;
  margin-top: 4.25rem;
  justify-content: space-between;
  background-color: #000;
  padding: 2.5rem 7rem 2.5rem 2.45rem;
  position: relative;
  .slider:focus {
    outline: none;
  }
  .pointers {
    display: flex;
    position: absolute;
    width: 6rem;
    justify-content: space-between;
    right: 2rem;
    top: 1.5rem;
    .pointer {
      cursor: pointer;
    }
  }
}
</style>
<script>
import Comment from "~/components/common/Comment";
import VueSlickCarousel from "vue-slick-carousel";
import "vue-slick-carousel/dist/vue-slick-carousel.css";
import "vue-slick-carousel/dist/vue-slick-carousel-theme.css";
export default {
  data() {
    return {
      comments: [
        {
          rating: 2,
          name: "Петров Иван Петрович",
          commentImg: "",
          text:
            "В данный момент я не имею в своем распоряжении AMG GT, но мне довелось на нем почти целый месяц проездить, пока я был в Калифорнии. Знаете, это довольно редкая машина не только в России, но и в США. Версия, на которой гонял я, была с 8-цилиндровым битурбированным двигателем мощностью 520 лошадиных сил. За все время езды на ней, я понял, что если я и куплю такой автомобиль, то не на каждый день. Из-за низкой посадки и особенностей управления очень устаешь. Подвеска, конечно, классная, но из-за того, что дорога у тебя под попой находится буквально в нескольких сантиметрах, все изъяны чувствуются. Выехать на выходных и наказать всяких гонщиков, вот для чего нужно ее покупать. По салону что сказать – Мерседес. Качество чувствуется во всем, кожа везде, где только можно, включая торпедо. В моей комплектации не была предусмотрена вентиляция сидений, этого реально не хватало. Но, думаю, в Москве эта опция вообще будет лишняя. Скорость этой машины заставляет все сжиматься внутри, такой мощи мне еще не приходилось встречать, даже в Мерседесах. Это что-то за гранью фантастики! Удивительно, что я так и не нашел отзывов об этом автомобиле в рамках нашей страны. То ли никто не ездит на такой, то ли времени нет писать. Поэтому не спешу с покупкой, хотелось бы, естественно, узнать, как она себя ведет в наших-то условиях.",
        },
        {
          rating: 5,
          name: "Пупкин Иван Евгеньевич",
          commentImg: require("~/assets/img/avatar-1.png"),
          text:
            "Удивительно, как в одной машине немецкому производителю удалось совместить практичность элегантного четырехдверного автомобиля и мощь спорткара. С виду это современная машина и трудно догадаться, что из-под капота готовы вырваться 460 мустангов. В салон решился заглянуть не сразу, сначала пришлось перевести дух от вида машины.Внутри – тишина и идеальный комфорт. Стильное информационное торпедо, в котором я, как водитель с опытом, разобрался достаточно быстро. Для защиты много подушек безопасности. Багажник приятный и глубокий, задние сидения раскладываются, и он становится побольше, если это конечно надо владельцу такой машины. Водительское место адаптировано для максимального комфорта при езде не высоких скоростях: сидения с боковой поддержкой от верха до низа, идеальная для агрессивной езды форма рулевого колеса.",
        },
        {
          rating: 3,
          name: "Пупкин Иван Евгеньевич",
          commentImg: require("~/assets/img/avatar-1.png"),
          text:
            "Удивительно, как в одной машине немецкому производителю удалось совместить практичность элегантного четырехдверного автомобиля и мощь спорткара. С виду это современная машина и трудно догадаться, что из-под капота готовы вырваться 460 мустангов. В салон решился заглянуть не сразу, сначала пришлось перевести дух от вида машины.Внутри – тишина и идеальный комфорт. Стильное информационное торпедо, в котором я, как водитель с опытом, разобрался достаточно быстро. Для защиты много подушек безопасности. Багажник приятный и глубокий, задние сидения раскладываются, и он становится побольше, если это конечно надо владельцу такой машины. Водительское место адаптировано для максимального комфорта при езде не высоких скоростях: сидения с боковой поддержкой от верха до низа, идеальная для агрессивной езды форма рулевого колеса.",
        },
        {
          rating: 3,
          name: "Пупкин Иван Евгеньевич",
          commentImg: require("~/assets/img/avatar-1.png"),
          text:
            "Удивительно, как в одной машине немецкому производителю удалось совместить практичность элегантного четырехдверного автомобиля и мощь спорткара. С виду это современная машина и трудно догадаться, что из-под капота готовы вырваться 460 мустангов. В салон решился заглянуть не сразу, сначала пришлось перевести дух от вида машины.Внутри – тишина и идеальный комфорт. Стильное информационное торпедо, в котором я, как водитель с опытом, разобрался достаточно быстро. Для защиты много подушек безопасности. Багажник приятный и глубокий, задние сидения раскладываются, и он становится побольше, если это конечно надо владельцу такой машины. Водительское место адаптировано для максимального комфорта при езде не высоких скоростях: сидения с боковой поддержкой от верха до низа, идеальная для агрессивной езды форма рулевого колеса.",
        },
        {
          rating: 2,
          name: "Пупкин Иван Евгеньевич",
          commentImg: require("~/assets/img/avatar-1.png"),
          text:
            "Удивительно, как в одной машине немецкому производителю удалось совместить практичность элегантного четырехдверного автомобиля и мощь спорткара. С виду это современная машина и трудно догадаться, что из-под капота готовы вырваться 460 мустангов. В салон решился заглянуть не сразу, сначала пришлось перевести дух от вида машины.Внутри – тишина и идеальный комфорт. Стильное информационное торпедо, в котором я, как водитель с опытом, разобрался достаточно быстро. Для защиты много подушек безопасности. Багажник приятный и глубокий, задние сидения раскладываются, и он становится побольше, если это конечно надо владельцу такой машины. Водительское место адаптировано для максимального комфорта при езде не высоких скоростях: сидения с боковой поддержкой от верха до низа, идеальная для агрессивной езды форма рулевого колеса.",
        },
        {
          rating: 2,
          name: "Пупкин Иван Евгеньевич",
          commentImg: require("~/assets/img/avatar-1.png"),
          text:
            "Удивительно, как в одной машине немецкому производителю удалось совместить практичность элегантного четырехдверного автомобиля и мощь спорткара. С виду это современная машина и трудно догадаться, что из-под капота готовы вырваться 460 мустангов. В салон решился заглянуть не сразу, сначала пришлось перевести дух от вида машины.Внутри – тишина и идеальный комфорт. Стильное информационное торпедо, в котором я, как водитель с опытом, разобрался достаточно быстро. Для защиты много подушек безопасности. Багажник приятный и глубокий, задние сидения раскладываются, и он становится побольше, если это конечно надо владельцу такой машины. Водительское место адаптировано для максимального комфорта при езде не высоких скоростях: сидения с боковой поддержкой от верха до низа, идеальная для агрессивной езды форма рулевого колеса.",
        },
        {
          rating: 1,
          name: "Пупкин Иван Евгеньевич",
          commentImg: require("~/assets/img/avatar-1.png"),
          text:
            "Удивительно, как в одной машине немецкому производителю удалось совместить практичность элегантного четырехдверного автомобиля и мощь спорткара. С виду это современная машина и трудно догадаться, что из-под капота готовы вырваться 460 мустангов. В салон решился заглянуть не сразу, сначала пришлось перевести дух от вида машины.Внутри – тишина и идеальный комфорт. Стильное информационное торпедо, в котором я, как водитель с опытом, разобрался достаточно быстро. Для защиты много подушек безопасности. Багажник приятный и глубокий, задние сидения раскладываются, и он становится побольше, если это конечно надо владельцу такой машины. Водительское место адаптировано для максимального комфорта при езде не высоких скоростях: сидения с боковой поддержкой от верха до низа, идеальная для агрессивной езды форма рулевого колеса.",
        },
        {
          rating: 1,
          name: "Пупкин Иван Евгеньевич",
          commentImg: require("~/assets/img/avatar-1.png"),
          text:
            "Удивительно, как в одной машине немецкому производителю удалось совместить практичность элегантного четырехдверного автомобиля и мощь спорткара. С виду это современная машина и трудно догадаться, что из-под капота готовы вырваться 460 мустангов. В салон решился заглянуть не сразу, сначала пришлось перевести дух от вида машины.Внутри – тишина и идеальный комфорт. Стильное информационное торпедо, в котором я, как водитель с опытом, разобрался достаточно быстро. Для защиты много подушек безопасности. Багажник приятный и глубокий, задние сидения раскладываются, и он становится побольше, если это конечно надо владельцу такой машины. Водительское место адаптировано для максимального комфорта при езде не высоких скоростях: сидения с боковой поддержкой от верха до низа, идеальная для агрессивной езды форма рулевого колеса. ",
        },
      ],
    };
  },
  components: {
    VueSlickCarousel,
    Comment,
  },
  methods: {
    showNext() {
      this.$refs.carousel.next();
    },
    showPrev() {
      this.$refs.carousel.prev();
    },
  },
};
</script>


